<template>
  <div class="study">
    <!--内部链接-->
    <a :href="img">内部链接</a>
    <!--外部链接-->
    <a href="http://www.deepseek.com" target="_blank">deepseek</a>
    <!--空链接-->
    <a href="#">产品介绍</a>
    <!--下载链接-->
    <a href="/down.7z" download="my">下载链接</a>
    <br />
    <a href="#1">1維基百科</a><br />
    <a href="#2">2網路媒體型式</a><br />
    <a href="#3">3歷史</a><br />
    <a href="#4">4版本時間線</a>

    <h1 id="1">維基百科，自由的百科全書</h1>
    <p>對於在維基百科上使用HTML，參見Help:HTML HTML （超文本標記語言） 副檔名 .html .htm</p>

    <h1 id="2">網路媒體型式</h1>
    <p>
      text/html 類型代碼 TEXT 開發者 W3C & WHATWG 首次發布 1993年，​33年前 最新版本 5.2[1]/
      5.3（工作草案）[2] 2017年12月14日，​8年前 格式類型 文件檔案格式 延伸自 SGML 延伸為 XHTML 標準
      ISO/IEC 15445 W3C HTML 5.1 HTML活動標準 免費格式？ 是 網站 www.w3.org/html/ whatwg.org HTML
      HTML動態HTMLHTML5 音訊畫布影片XHTML 基礎移動概要C-HTMLHTML元素
      span與divHTML特性HTML框架HTML編輯器字元編碼 Unicode語言代碼文件物件模型瀏覽器對象模型樣式表
      階層式樣式表字型家族網頁顏色HTML指令碼JavaScript WebGLWebCLW3C
      驗証服務網頁超文字應用技術工作小組怪異模式網頁儲存排版引擎 比較
      文件標記語言網頁瀏覽器HTML非標準HTMLHTML5 畫布媒體XHTML 1.1 閱論編
      超文本標記語言（英語：HyperText Markup
      Language，簡稱：HTML）是一種用於建立網頁的標準標記語言。HTML是一種基礎技術，常與CSS、JavaScript一起被眾多網站用於設計網頁、網頁應用程式以及行動應用程式的使用者介面[3]。網頁瀏覽器可以讀取HTML檔案，並將其渲染成視覺化網頁。HTML檔案以「.htm」和「.html」為檔名，是一種純文字檔案，可以使用記事本、寫字板等文字編輯器進行編輯，也可以使用Frontpage、Dreamweaver等網頁製作軟體進行快速建立與編輯。HTML描述了一個網站的結構語意隨著線索的呈現，使之成為一種標記語言而非程式語言。
      HTML元素是構建網站的基石。HTML允許嵌入圖像與對象，並且可以用於建立互動式表單，它被用來結構化資訊——例如標題、段落和列表等等，也可用來在一定程度上描述文件的外觀和語意。HTML的語言形式為尖括號包圍的HTML元素（如），瀏覽器使用HTML標籤和指令碼來詮釋網頁內容，但不會將它們顯示在頁面上。
      HTML可以嵌入如JavaScript的手稿語言，它們會影響HTML網頁的行為。網頁瀏覽器也可以參照階層式樣式表（CSS）來定義文字和其它元素的外觀與布局。維護HTML和CSS標準的組織全球資訊網協會（W3C）鼓勵人們使用CSS替代一些用於表現的HTML元素[4]。
    </p>
    <h1 id="3">歷史</h1>

    <p>
      W3C製作的早期HTML標誌 發展 提姆·柏內茲-李
      1980年，物理學家提姆·柏內茲-李在歐洲核子研究中心（CERN）在承包工程期間，為使CERN的研究人員使用並共享文件，他提出並建立原型系統ENQUIRE。1989年，柏內茲-李在一份備忘錄中提出一個基於網際網路的超文字系統[5]。他制定HTML並在1990年底寫出瀏覽器和伺服器軟體。同年，柏內茲-李與CERN的資料系統工程師羅伯特·卡里奧聯合為專案申請資助，但未被CERN正式批准。在他的個人筆記中[6]柏內茲-李列舉「一些使用超文字的領域」，並把百科全書列為第一項[7]。
      HTML的首次公開描述出現於一個名為HTML
      Tags[8]的檔案中，由提姆·柏內茲-李於1991年底提及[9][10]。它描述18個元素，包括HTML初始的、相對簡單的設計。除了超連結標籤外，其他設計都深受CERN內部一個以標準通用標記語言（SGML）為基礎的檔案格式SGMLguid的影響。這些元素仍有11個存在於HTML
      4中[11]。
      柏內茲-李認為HTML是SGML的一個應用程式。1993年中期網際網路工程任務組（IETF）發布首個HTML規範的提案：「超文本標記語言（HTML）」網際網路草案[12]，由柏內茲-李與丹·康納利撰寫。其中包括一個SGML文件類型定義來定義語法[13]。草案於6個月後過期，不過值得注意的是其對NCSA
      Mosaic瀏覽器嵌入線上圖像的自訂標籤的認可，這反映IETF把標準立足於成功原型的理念[14]。同樣，戴夫·拉格特在1993年末提出的與之競爭的網際網路草案「HTML+（超文字標記格式）」建議規範已經實現的功能，如表格與填寫表單[15]。
      在HTML和HTML+的草案於1994年初到期後，IETF建立一個HTML工作群組，並在1995年完成"HTML
      2.0"，這是第一個旨在成為對其後續實現標準的依據的HTML規範[16]。
      在IETF的主導下，HTML標準的進一步發展因競爭利益而遭受停滯。自1996年起，HTML規範一直由全球資訊網協會（W3C）維護，並由商業軟體廠商出資[17]。不過在2000年，HTML也成為國際標準（ISO/
      IEC15445：2000）。HTML
      4.01於1999年末發布，進一步的勘誤版本於2001年發布。2004年，網頁超文字應用技術工作小組（WHATWG）開始開發HTML5，並在2008年與W3C共同提出，2014年10月28日完成標準化[18]。
    </p>
    <h1 id="4">版本時間線</h1>
    <p>
      HTML 2 1995年11月24日 HTML 2.0作為IETF RFC 1866發布。追加RFC的附加功能： 1995年11月25日：RFC
      1867（基於表單的檔案上傳） 1996年5月：RFC 1942（表格） 1996年8月：RFC 1980（客戶端圖像對映）
      1997年1月：RFC 2070（國際化） HTML 3 1997年1月14日 HTML
      3.2[19]作為W3C推薦標準發布。這是首個完全由W3C開發並標準化的版本，因IETF於1996年9月12日關閉它的HTML工作群組[20]。最初代號為「威爾伯」（Wilbur）[21]，HTML
      3.2完全去除數學公式，協調各種專有擴充，並採用網景設計的大多數視覺標記標籤。由於兩家公司達成了協議，網景的Blink元素和微軟的Marquee元素被移除[17]。HTML對數學公式的支援最後成為另外一種被稱為MathML的標準。
      HTML 4 1997年12月18日 HTML 4.0[22]作為W3C推薦標準發布。它提供三種變化：
      嚴格，過時的元素被禁止。 過渡，過時的元素被允許。 框架集，大多只與框架相關的元素被允許。
      最初代號「美洲獅」（Cougar）[21]， HTML
      4.0採用許多特定瀏覽器的元素類型和屬性，並試圖淘汰網景的視覺標記功能，將其標記為不贊成使用。HTML
      4是遵循ISO 8879 - SGML的SGML應用程式[23]。 1998年4月24日 HTML 4.0[24]進行微調，不增加版本號。
      1999年12月24日 HTML
      4.01[25]作為W3C推薦標準發布。它同樣提供三種變化，最終勘誤版[26]於2001年5月12日發布。 2000年5月
      ISO/IEC 15445:2000[27][28]（"ISO HTML"，基於HTML
      4.01嚴格版）作為ISO/IEC國際標準發布。在ISO中這一標準位於ISO/IEC JTC 1/SC
      34域（ISO/IEC聯合技術委員會1、小組委員會34 – 文件描述與處理語言）[27]。 HTML 5 主條目：HTML5
      2014年10月28日 HTML 5[29]作為W3C推薦標準發布[30]。
    </p>
  </div>
</template>

<script setup lang="ts">
import { onMounted } from 'vue'
import img from '@/assets/study/2.png'
// 接收返回值
const props = defineProps<{
  userId?: string
}>()
onMounted(() => {
  console.log('userId=', props.userId)
})
</script>

<style scoped>
/**
通常情况下，网页的滚动条是由浏览器窗口（html 或 body）生成的，而不是你定义的 <div class="study">。
如果你的页面是全局滚动的： 滚动条属于 html。
如果你的 .study 设置了固定高度和 overflow: auto： 滚动条才属于 .study
 */
.study {
  height: 100vh; /* 必须有固定高度 */
  overflow-y: auto; /* 必须允许纵向滚动 */
  scroll-behavior: smooth;
}
</style>
